In [4]:
import pandas as pd
import numpy as np

In [5]:
result = pd.read_csv('results.csv')

In [6]:
result.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [7]:
result.shape

(40945, 9)

In [8]:
result.shape[0]

40945

In [9]:
print(result.shape[1])

9

In [10]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40945 entries, 0 to 40944
Data columns (total 9 columns):
date          40945 non-null object
home_team     40945 non-null object
away_team     40945 non-null object
home_score    40945 non-null int64
away_score    40945 non-null int64
tournament    40945 non-null object
city          40945 non-null object
country       40945 non-null object
neutral       40945 non-null bool
dtypes: bool(1), int64(2), object(6)
memory usage: 2.5+ MB

In [11]:
#print the name of all the columns
result.columns

Index(['date', 'home_team', 'away_team', 'home_score', 'away_score',
       'tournament', 'city', 'country', 'neutral'],
      dtype='object')

In [12]:
# what is the name of 7th columns
result.columns[6]

'city'

In [13]:
# the type of the observation of the 7th columns
result.dtypes['date']

dtype('O')

In [14]:
result.index

RangeIndex(start=0, stop=40945, step=1)

In [15]:
result.values[2][1]

'Scotland'

In [16]:
result.tail(3)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
40942,2019-09-18,DR Congo,Rwanda,2,3,Friendly,Kinshasa,DR Congo,True
40943,2019-09-29,Bangladesh,Bhutan,4,1,Friendly,Dhaka,Bangladesh,False
40944,2019-09-30,Botswana,Liberia,0,0,Friendly,Gaborone,Botswana,False

In [17]:
result.shape[0]

40945

In [18]:
result.shape[1]

9

In [19]:
#print the name of all the columns
result.columns

Index(['date', 'home_team', 'away_team', 'home_score', 'away_score',
       'tournament', 'city', 'country', 'neutral'],
      dtype='object')

In [20]:
result.dtypes

date          object
home_team     object
away_team     object
home_score     int64
away_score     int64
tournament    object
city          object
country       object
neutral         bool
dtype: object

In [21]:
result.country
#OR
result['country']

0                   Scotland
1                    England
2                   Scotland
3                    England
4                   Scotland
5                   Scotland
6                    England
7                      Wales
8                   Scotland
9                   Scotland
10                   England
11                   England
12                     Wales
13                  Scotland
14                     Wales
15                  Scotland
16                   England
17                   England
18                     Wales
19       Republic of Ireland
20                     Wales
21                  Scotland
22                     Wales
23                  Scotland
24                   England
25                   England
26                   England
27                     Wales
28       Republic of Ireland
29       Republic of Ireland
                ...
40915             Azerbaijan
40916                Hungary
40917                 Poland
40918               Slovenia
40919                 Latvia
40920               Scotland
40921                 Russia
40922             San Marino
40923          United States
40924          United States
40925          United States
40926                Ecuador
40927               Honduras
40928                 France
40929                 Jordan
40930                Morocco
40931                   Oman
40932    Republic of Ireland
40933                  Egypt
40934                  Egypt
40935                England
40936             Montenegro
40937             Luxembourg
40938              Lithuania
40939                Albania
40940                 France
40941                Moldova
40942               DR Congo
40943             Bangladesh
40944               Botswana
Name: country, Length: 40945, dtype: object

In [22]:
# How many different country there are in this dataset
result.country.nunique()

266

In [23]:
# what is the most frequent country
result.country.value_counts().head()

United States    1151
France            803
England           689
Malaysia          645
Sweden            638
Name: country, dtype: int64

In [24]:
#Summarize the DataFrame
result.describe()

         home_score    away_score
count  40945.000000  40945.000000
mean       1.745463      1.188521
std        1.748619      1.405116
min        0.000000      0.000000
25%        1.000000      0.000000
50%        1.000000      1.000000
75%        2.000000      2.000000
max       31.000000     21.000000

In [25]:
#Summarize all the columns
result.describe(include= "all")
#Notice: By default, only the numeric columns are returned.

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
count,40945,40945,40945,40945.000000,40945.000000,40945,40945,40945,40945
unique,15133,311,307,NaN,NaN,109,1965,266,2
top,2012-02-29,Brazil,Uruguay,NaN,NaN,Friendly,Kuala Lumpur,United States,False
freq,66,565,538,NaN,NaN,16967,582,1151,30756
mean,NaN,NaN,NaN,1.745463,1.188521,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,1.748619,1.405116,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,0.000000,0.000000,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,1.000000,0.000000,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,1.000000,1.000000,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,2.000000,2.000000,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,31.000000,21.000000,NaN,NaN,NaN,NaN

In [26]:
# summarize only the country columns
result.country.describe()

count             40945
unique              266
top       United States
freq               1151
Name: country, dtype: object

In [27]:
#what is the mean home_score
result.home_score.mean()

1.745463426547808

In [28]:
round(result.home_score.mean())

2

In [29]:
#what is the home_score with least occurrence
result.home_score.value_counts()

1     12110
0      9826
2      9055
3      4812
4      2490
5      1185
6       646
7       346
8       192
9       116
10       59
11       33
12       26
13       13
14       10
15        7
16        6
17        3
19        3
30        1
18        1
20        1
21        1
22        1
24        1
31        1
Name: home_score, dtype: int64

In [30]:
result.home_score.max()

31

In [33]:
result.away_score.describe
result.away_score.max()

21

In [35]:
result.away_score.value_counts()

0     15170
1     13229
2      7108
3      3062
4      1274
5       531
6       270
7       133
8        66
9        36
10       20
12        8
13        7
11        6
15        6
18        5
20        3
16        3
17        3
14        2
19        2
21        1
Name: away_score, dtype: int64

In [36]:
result.away_score.value_counts().head()

0    15170
1    13229
2     7108
3     3062
4     1274
Name: away_score, dtype: int64